[
  {
    "slug": "gain-momentum",
    "title": "We've Entered a Project-Based Era but Leaders Are Still Avoiding the Hard Parts",
    "excerpt": "Successful businesses today are increasingly run on projects, however many are still hard-wired for functional, steady-state work. That mismatch quietly undermines transformation success more than strategy or culture.",
    "publish_date": "2026-02-05",
    "published": true,
    "author": "New Wave Associates",
    "reading_time": "6 min",
    "tags": ["Execution", "Operating Model", "Transformation"],
    "hero_image": "",
    "content": "<div class=\"executive-summary\"><p><strong>Executive Summary:</strong> Successful businesses today are increasingly run on projects, however many are still hard-wired for functional, steady-state work. That mismatch quietly undermines transformation success more than strategy or culture. The failure pattern is consistent: leaders overlook the same execution fundamentals—accountability, decision-making, and operational rigor. These aren’t “blind spots”; they reflect a reluctance to make uncomfortable tradeoffs, like naming clear owners, clarifying decision rights, and saying “no” to competing priorities. Winning organizations redesign execution itself, treating governance, metrics, and capacity management as core operating disciplines, not optional add-ons.</p></div><p>We have entered a project-based era of execution, whether leaders have embraced it or not. Experts increasingly see project-based work as the dominant mode of current and future work. The modern enterprise will no longer execute strategy through steady-state functions.</p><p>Growth initiatives, digital modernization, M&amp;A integrations, operating model redesigns, cost takeout programs—nearly all meaningful value today is delivered through projects and programs rather than steady-state functional work. Think: an organization in a constant cycle of system upgrades, process changes, tool rollouts, and workforce retraining. Each effort has a defined start and end, cuts across functions, and only creates value if executed in sequence—yet some leaders still treat this work as “business as usual”. The conditions under which modern organizations operate have changed. Distributed work, AI-driven change, interconnected technology stacks, and faster decision cycles have made execution more interdependent and time-bound, however, many leadership systems are still designed for a functional world optimized for stability, predictability, and incremental improvement.</p><p>That mismatch—not strategy, not culture—quietly undermines transformation in even the strongest organizations. And it’s only part of the story.</p><p>Recent research published in the Harvard Business Review and by McKinsey reinforces this reality. Transformation failure is rarely caused by a lack of ambition or intelligence. Instead, it stems from a tendency to overlook the “difficult” elements of execution: accountability, decision-making, and operational rigor. Research shows that, more often than not, leaders focus their time and attention away from the most impactful elements of transformation—prioritizing lower-impact objectives and eroding the odds of lasting success. Management research describes these as “blind spots.” In practice, they are decisions—choices that get delayed, softened, or avoided because they introduce friction, exposure, or discomfort.</p><h2>The Shift No One Officially Announced</h2><p>Organizations didn’t wake up and choose project-based work. They were pushed into it by a set of structural forces that made steady-state execution insufficient. Strategy stopped being incremental, technology turned change into a constant, coordination across functions became default, and the pace of change accelerated. In this new norm, leaders are constantly redesigning operating models, reprioritizing their portfolios, and evolving their technology stacks. Competitive pressures demand speed and adaptability— keep up, or fade away forever.</p><p>But while the work is changing, the way organizations govern often has not caught up.</p><p>Functional hierarchies still dominate decision rights. Performance systems still reward local optimization. Transformation work is layered on top of already full plates and labeled as “strategic,” as if that alone creates capacity.</p><p>If any of these sound familiar, you might want to keep reading:</p><ul><li>Too many initiatives launched or in-flight at once</li><li>Excess work in progress with too little being completed</li><li>Frequent handoffs that slow execution and increase risk</li><li>Insufficient measurable progress towards strategic goals</li></ul><p>In short, organizations appear busier than ever, but real momentum has stalled. Leaders feel the drag. And even as many organizations adopt a more project-based approach, they still struggle to pinpoint why transformation outcomes fall short. The issue isn’t effort or ambition. It’s structural misalignment—and an avoidance of the execution fundamentals that matter most.</p><p>A project-based environment creates the conditions for better execution, but it does not guarantee it. In practice, execution speed and reliability depend less on intent and more on how accountability, decision-making, and operational rigor are designed and established.</p><p>When project-based environments work well, a few fundamentals are consistently present:</p><ul><li>Clear accountability for outcomes</li><li>Explicit and accessible decision-makers</li><li>Clear operating rhythms, cadences, and expectations for delivery</li><li>Initiatives linked to financial outcomes, tracking benefits, and managing tradeoffs</li><li>Leaders actively pushing for results, resolving issues, and not accepting vague progress</li><li>Making results, misses, and risks visible, not buried in decks or status language</li></ul><p>Without these basics, project-based work simply reorganizes the chaos. With them, it becomes a powerful operating system for execution.</p><h2>The Uncomfortable Work Carries Disproportionate Weight.</h2><p>Everyone wants positive, sustainable transformation outcomes. That’s not the issue.</p><p>In practice, what I’ve seen—repeatedly—is that leaders and organizations shy away from the uncomfortable parts of execution. Not because they don’t care. Not because they haven’t heard the concepts before. But because these elements introduce friction, exposure, and personal accountability in ways that other improvement efforts do not.</p><p>Accountability. Decision-making. Operational rigor.</p><p>These aren’t new ideas. They’re familiar. And yet they’re consistently underemphasized.</p><p>The reason matters.</p><p>In many cases, leaders underestimate how much these fundamentals actually matter. They treat them as table stakes—important, but interchangeable with softer efforts like collaboration norms, alignment workshops, or continuous improvement rituals. In reality, they carry disproportionate weight in determining whether a transformation succeeds or stalls.</p><p>Other times, the avoidance is more human. These fundamentals force tradeoffs. They surface conflict. They make underperformance visible. They narrow room for ambiguity. And that discomfort is easy to defer when progress can be simulated elsewhere.</p><p>The result is a subtle but consequential misallocation of attention: enormous effort invested in lower-impact activities, which the few levers that most directly govern execution are left vague, delayed, or diluted.</p><p>This is why I’m writing this. Not to argue that collaboration, culture, or improvement don’t matter—but to make clear that some fundamentals matter more, and that sustained success depends on whether leaders are willing to give those fundamentals the attention they warrant.</p><h2>1. Accountability: The Backbone Missing from Transformations</h2><p>Accountability sounds simple, until it isn’t.</p><p>In every major transformation, organizations task people with two jobs: keep the lights on and change how the lights work.</p><p>Every stalled initiative I’ve seen could be traced back to a moment where accountability was intentionally left vague to preserve harmony. Who owns the outcome? Who makes tradeoffs when priorities collide? Who is accountable when progress stalls?</p><p>When these answers are unclear, transformation becomes performative. Status meetings multiply, but nothing ends up happening. Workstreams drift. Risks surface late—if at all.</p><p>Accountability is not about control. It is about clarity. And clarity, introduced early, creates momentum.</p><h2>2. Decision-Making: The Constraint Leaders Must Address</h2><p>If this is hard for you to hear, I’m talking to you. Decision-making is one of the most consistently underdeveloped capabilities in transformation efforts—and one of the least openly discussed.</p><p>Leaders rarely want to admit that decision velocity or decision quality is a problem, especially when standing before boards or investors while announcing a major change initiative. Confidence matters, but so does credibility.</p><p>What’s worse? Avoiding the topic doesn’t eliminate the issue. It amplifies it.</p><p>In a project-based environment, slow or ambiguous decision-making becomes a structural bottleneck. Teams wait. Work queues up. Energy dissipates. Eventually, people stop raising issues because they learn nothing moves.</p><p>Decision frameworks are often resisted not because they are ineffective, but because they reveal where authority actually lives—and where it doesn’t.</p><p>Strong transformations design decision-making deliberately:</p><ul><li>Clear ownership</li><li>Defined escalation paths</li><li>Data-informed criteria</li><li>Time-bound decisions tied to milestones</li></ul><p>This isn’t bureaucracy. It’s execution hygiene.</p><h2>3. Operational Rigor: The Discipline That Turns Intent into Results</h2><p>Transformation success depends on more than effort. It depends on visibility.</p><p>Clear goals, shared metrics, and honest progress tracking create what I think of as a “performance edge”—the ability to course-correct early rather than react late.</p><p>In high-stakes environments like M&amp;A cutovers, readiness assessments are not checklists. They are confidence signals. They tell leaders whether the organization is truly prepared to move forward—or simply hoping for the best.</p><p>The same principle applies to enterprise transformation. Without visibility into readiness, risks remain hidden. Decisions are delayed. Confidence erodes.</p><p>Progress must be observable, not assumed.</p><h2>Protecting the People Doing the Heavy Lifting Is Not Optional</h2><p>Rigorous execution brings clarity. Clarity brings exposure.</p><p>When organizations introduce real accountability, explicit decision-making, and transparent progress tracking, the people doing the work become unmistakably visible. Who owns what. Who is overloaded. Where bottlenecks live. Who is carrying risk.</p><p>At the center of every transformation is a small group of highly capable doers who carry a disproportionate share of the load. These are your make-it-happen people.</p><p>They are invaluable. They are also finite.</p><p>In many organizations, transformation work is treated as an overlay rather than a redesign. People are expected to “fit it in” around their day jobs. Context switching becomes constant. Fatigue accumulates. Risks go unspoken.</p><p>Teams stay busy, but momentum slows.</p><p>A healthy transformation system protects its people:</p><ul><li>Capacity is explicitly acknowledged and actively managed</li><li>Psychological safety is monitored, not assumed</li><li>Critical contributors are shielded from sustained overload and hidden risk</li></ul><p>This isn’t a cultural nice-to-have. It’s an execution requirement. Even the best-designed transformation will fail if the team is exhausted, overstretched, or operating in fear.</p><h2>The Real Work of Transformation</h2><p>True transformation requires more than vision and resolve. It requires leaders to redesign how work gets done when everything becomes a project.</p><p>That means confronting the hard parts early:</p><ul><li>Who is accountable</li><li>How decisions are made</li><li>What gets prioritized—and what doesn’t</li><li>How people are protected while doing difficult work</li></ul><p>These are not theoretical concepts. They are disciplines.</p><p>Transformation doesn’t fail for lack ambition. It fails because leadership systems remain anchored in a world that no longer exists.</p><p>The organizations that succeed are not those with the boldest strategies, but those willing to confront the uncomfortable execution disciplines that make progress unavoidable.</p>"
  }
]
